class Azkar {
  final String title;
  final String image;
  final List<ZikrItem> content;

  Azkar({
    required this.title,
    required this.image,
    required this.content,
  });
}

class ZikrItem {
  final String zekr;
  int repeat;
  final String bless;

  ZikrItem({
    required this.zekr,
    required this.repeat,
    required this.bless,
  });
}

List sugg = [
  ". اللَهُمَّ صلِّ وسَلِم وبَارِك على سيدنا محمد (ﷺ).",
  "يَا رَبِّ، لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ، وَلِعَظِيمِ سُلْطَانِكَ.",
  "أَسْتَغْفِرُ اللَّهَ الْعَظِيمَ الَّذِي لاَ إِلَهَ إِلَّا هُوَ، الْحَيُّ الْقَيُّومُ، وَأَتُوبُ إِلَيْهِ.",
  "سُبْحَانَ اللهِ وَبِحَمْدِهِ.",
  "سـبحان الله، والحمـد لله، والله أكـبر.",
  "لا إله إلا الله وحـده لا شريك له، له الملك وله الحمد، وهو على كل شيء قـدير.",
];

List<Azkar> azkarr = [
  Azkar(
// "أذكار الصباح"
      title: "أذكار الصباح",
      image: 'images/sunrise1.png',
      content: [
        ZikrItem(
            zekr:
                "           أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ \n الله لا إلـه إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤوده حفظهما وهو العلي العظيم' -آية الكرسي,البقرة ,255.",
            repeat: 1,
            bless:
                "من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح."),
        ZikrItem(
          zekr:
              "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.",
          repeat: 3,
          bless:
              "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين).",
        ),
        ZikrItem(
          zekr:
              "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.",
          repeat: 3,
          bless:
              "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين).",
        ),
        ZikrItem(
          zekr:
              "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.",
          repeat: 3,
          bless:
              "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين).",
        ),
        ZikrItem(
          zekr:
              "أَصْبَحْنا وَأَصْبَحَ المُلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُلْكُ ولهُ الحَمْد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْأَلُكَ خَيرَ ما في هـذا اليوم وَخَيرَ ما بَعْدَه ، وَأَعوذُ بِكَ مِنْ شَرِّ ما في هـذا اليوم وَشَرِّ ما بَعْدَه، رَبِّ أَعوذُبِكَ مِنَ الْكَسَلِ وَسوءِ الْكِبَرِ ، رَبِّ أَعوذُ بِكَ مِنْ عَذابٍ في النّارِ وَعَذابٍ في القَبر.",
          repeat: 1,
          bless: "",
        ),
        ZikrItem(
          zekr:
              "اللّهُـمَّ أَنْتَ رَبِّي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنِي وَأَنا عَبْدُك ، وَأَنا عَلَى عَهْدِكَ وَوَعْدِكَ ما اسْتَطَعْتُ ، أَعوذُبِكَ مِنْ شَرِّ ما صَنَعْتُ ، أَبُوءُ لَكَ بِنِعمَتِكَ عَلَيَّ وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لي فَإِنَّهُ لا يَغْفِرُ الذُّنوبَ إِلاّ أَنْتَ.",
          repeat: 1,
          bless:
              "من قالها موقناً بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح.",
        ),
        ZikrItem(
          zekr:
              "رَضيـتُ بِاللهِ رَبًّا وَبِالإسْلامِ دِينًا وَبِمُحَمَّدٍ صلى الله عليه وسلم نَبِيًّا.",
          repeat: 3,
          bless:
              "من قالها حين يصبح وحين يمسى كان حقًا على الله أن يرضيه يوم القيامة.",
        ),
        ZikrItem(
          zekr:
              "اللّهُـمَّ إِنِّي أَصْبَحْتُ أُشْهِدُك ، وَأُشْهِدُ حَمَلَةَ عَرْشِكَ ، وَمَلَائِكَتِكَ ، وَجَمِيعَ خَلْقِكَ ، أَنَّكَ أَنْتَ اللهُ لا إلهَ إلاّ أَنْتَ وَوَحْدَكَ لا شَريكَ لَكَ ، وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ.",
          repeat: 4,
          bless: "من قالها أعتقه الله من النار.",
        ),
        ZikrItem(
          zekr:
              "اللّهُـمَّ ما أَصْبَحَ بي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ ، فَمِنْكَ وَحْدَكَ لا شَريكَ لَكَ ، فَلَكَ الْحمدُ وَلَكَ الشُّكر.",
          repeat: 1,
          bless: "من قالها حين يصبح أدى شكر يومه.",
        ),
        ZikrItem(
          zekr:
              "حَسْبِيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ العَرْشِ العَظِيم.",
          repeat: 7,
          bless: "من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة.",
        ),
        ZikrItem(
          zekr:
              "بِسْمِ اللهِ الَّذِي لا يَضُرُّ مَعَ اسْمِهِ شَيءٌ فِي الأَرْضِ وَلا فِي السَّماءِ وَهُوَ السَّمِيعُ العَلِيم.",
          repeat: 3,
          bless: "لم يضره من الله شيء.",
        ),
        ZikrItem(
          zekr:
              "اللّهُـمَّ بِكَ أَصْبَحْنا وَبِكَ أَمْسَينا ، وَبِكَ نَحْيا وَبِكَ نَمُوتُ وَإِلَيْكَ النُّشُور.",
          repeat: 1,
          bless: "",
        ),
        ZikrItem(
          zekr:
              "أَصْبَحْنا عَلَى فِطْرَةِ الإِسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ آبَائِنَا إِبْرَاهِيمَ حَنِيفًا مُسْلِمًا وَمَا كَانَ مِنَ المشركين.",
          repeat: 1,
          bless: "",
        ),
        ZikrItem(
          zekr:
              "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ عَدَدَ خَلْقِهِ ، وَرِضَا نَفْسِهِ ، وَزِنَةَ عَرْشِهِ ، وَمِدَادَ كَلِمَاتِهِ.",
          repeat: 3,
          bless: "",
        ),
        ZikrItem(
          zekr:
              "اللَّهُـمَّ عَافِنِي فِي بَدَنِي ، اللَّهُـمَّ عَافِنِي فِي سَمْعِي ، اللَّهُـمَّ عَافِنِي فِي بَصَرِي ، لا إلهَ إلاّ أَنْتَ.",
          repeat: 3,
          bless: "",
        ),
        ZikrItem(
          zekr:
              "اللَّهُـمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ ، وَالْفَقْرِ ، وَأَعُوذُ بِكَ مِنْ عَذابِ الْقَبْرِ ، لا إلهَ إلاّ أَنْتَ.",
          repeat: 3,
          bless: "",
        ),
        ZikrItem(
          zekr:
              "اللَّهُـمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ ، اللَّهُـمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيةَ فِي ديني وَدُنْيَايَ وَأَهْلِي وَمَالِي ، اللَّهُـمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتي ، اللَّهُـمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي وَعَنْ يَمِينِي وَعَنْ شِمَالِي ، وَمِنْ فَوْقِي ، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي.",
          repeat: 1,
          bless: "",
        ),
        ZikrItem(
          zekr:
              "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ أَصْلِحْ لِي شَأْنِي كُلَّهُ وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ.",
          repeat: 3,
          bless: "",
        ),
        ZikrItem(
          zekr:
              "أَصْبَحْنا وَأَصْبَحْ المُـلكُ للهِ رَبِّ العـالَمِـين ، اللَّهُـمَّ إِنِّـي أسْـأَلُـكَ خَيْرَ هـذا الـيَوْم ، فَتْحَهُ ، وَنَصْـرَهُ ، وَنُورَهُ وَبَـرَكَتَهُ ، وَهُـدَاهُ ، وَأَعْـوذُ بِـكَ مِـنْ شَرِّ مَا فِـيهِ وَشَرِّ مَا بَعْـدَهُ.",
          repeat: 1,
          bless: "",
        ),
        ZikrItem(
          zekr:
              "اللَّهُـمَّ عَالِـمَ الغَـيبِ وَالشّـهادَةِ فاطِـرَ السَّمَاوَاتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَلِكَهُ ، أَشْهَـدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا أَوْ أُجْرِّهِ إِلَى مُسْلِمٍ.",
          repeat: 1,
          bless: "",
        ),
        ZikrItem(
          zekr:
              "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ.",
          repeat: 3,
          bless: "",
        ),
        ZikrItem(
          zekr:
              "اللَّـهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ، وَبَارِكْ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ.",
          repeat: 10,
          bless: "من صلى على حين يصبح وحين يمسى أدركته شفاعتي يوم القيامة.",
        ),
        ZikrItem(
          zekr:
              "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لاَ نَعْلَمُهُ.",
          repeat: 3,
          bless: "",
        ),
        ZikrItem(
          zekr:
              "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنَ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ.",
          repeat: 3,
          bless: "",
        ),
        ZikrItem(
          zekr:
              "أَسْتَغْفِرُ اللَّهَ الْعَظِيمَ الَّذِي لاَ إِلَهَ إِلَّا هُوَ، الْحَيُّ الْقَيُّومُ، وَأَتُوبُ إِلَيْهِ.",
          repeat: 3,
          bless: "",
        ),
        ZikrItem(
          zekr:
              "يَا رَبِّ، لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ، وَلِعَظِيمِ سُلْطَانِكَ.",
          repeat: 3,
          bless: "",
        ),
        ZikrItem(
          zekr:
              "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا.",
          repeat: 1,
          bless: "",
        ),
        ZikrItem(
          zekr:
              "اللَّهُمَّ أَنْتَ رَبِّي لاَ إِلَهَ إِلا أَنْتَ، عَلَيْكَ تَوَكَّلْتُ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ، مَا شَاءَ اللَّهُ كَانَ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ الْعَلِيِّ الْعَظِيمِ، أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ.",
          repeat: 1,
          bless: "",
        ),
        ZikrItem(
          zekr:
              "لاَ إِلَهَ إِلَّا اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٍ.",
          repeat: 100,
          bless:
              "كانتْ له عدل عشر رقابٍ، وكتبَتْ له مئة حسنةٍ، ومُحِيَتْ عنه مئة سيئةٍ، وكانتْ له حرزًا من الشيطانِ.",
        ),
        ZikrItem(
          zekr: "سُبْحَانَ اللهِ وَبِحَمْدِهِ.",
          repeat: 100,
          bless:
              "حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ.",
        ),
        ZikrItem(
          zekr: "أَسْتَغْفِرُ اللهَ وَأَتُوبُ إِلَيْهِ",
          repeat: 100,
          bless:
              "مائة حسنةٍ، ومُحِيَتْ عنه مائة سيئةٍ، وكانتْ له حرزًا من الشيطانِ حتى يمسى.",
        ),
      ]),
// "أذكار المساء"
  Azkar(
    title: "أذكار المساء",
    image: 'images/night.png',
    content: [
      ZikrItem(
        zekr:
            "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ 'الله لا إلـه إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤوده حفظهما وهو العلي العظيم' -آية الكرسي,البقرة ,255.",
        repeat: 1,
        bless:
            "من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح.",
      ),
      ZikrItem(
        zekr:
            "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَّسِينَآ أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ. [البقرة 285 - 286]",
        repeat: 1,
        bless: "من قرأ آيتين من آخر سورة البقرة في ليلة كفتاه.",
      ),
      ZikrItem(
        zekr:
            "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.",
        repeat: 3,
        bless:
            "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين).",
      ),
      ZikrItem(
        zekr:
            "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.",
        repeat: 3,
        bless:
            "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين).",
      ),
      ZikrItem(
        zekr:
            "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.",
        repeat: 3,
        bless:
            "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين).",
      ),
      ZikrItem(
        zekr:
            "أَمْسَيْـنا وَأَمْسـى المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلْكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَرِ ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.",
        repeat: 1,
        bless: "",
      ),
      ZikrItem(
        zekr:
            "اللّهُـمَّ أَنْتَ رَبِّي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ.",
        repeat: 1,
        bless:
            "من قالها موقناً بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح.",
      ),
      ZikrItem(
        zekr:
            "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً.",
        repeat: 3,
        bless:
            "من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة.",
      ),
      ZikrItem(
        zekr:
            "اللّهُـمَّ إِنِّـي أَمْسَيْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتِكَ ، وَجَمِيعَ خَلْـقِكَ ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسُولُـكَ.",
        repeat: 4,
        bless: "من قالها أعتقه الله من النار.",
      ),
      ZikrItem(
        zekr:
            "اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.",
        repeat: 1,
        bless: "من قالها حين يصبح أدى شكر يومه.",
      ),
      ZikrItem(
        zekr:
            "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم.",
        repeat: 7,
        bless: "من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة.",
      ),
      ZikrItem(
        zekr:
            "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.",
        repeat: 3,
        bless: "لم يضره من الله شيء.",
      ),
      ZikrItem(
        zekr:
            "اللّهُـمَّ بِكَ أَمْسَيْـنا وَبِكَ أَصْـبَحْنا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور.",
        repeat: 1,
        bless: "",
      ),
      ZikrItem(
        zekr:
            "أَمْسَيْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْרَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.",
        repeat: 1,
        bless: "",
      ),
      ZikrItem(
        zekr:
            "سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه.",
        repeat: 3,
        bless: "",
      ),
      ZikrItem(
        zekr:
            "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ.",
        repeat: 3,
        bless: "",
      ),
      ZikrItem(
        zekr:
            "اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ.",
        repeat: 3,
        bless: "",
      ),
      ZikrItem(
        zekr:
            "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.",
        repeat: 1,
        bless: "",
      ),
      ZikrItem(
        zekr:
            "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ.",
        repeat: 3,
        bless: "",
      ),
      ZikrItem(
        zekr:
            "أَسْتَغْفِرُ اللهَ الْعَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الْحَيُّ الْقَيُّومُ، وَأتُوبُ إلَيهِ.",
        repeat: 3,
        bless: "",
      ),
      ZikrItem(
        zekr:
            "أَمْسَيْنا وَأَمْسَى المُـلْكُ للهِ رَبِّ العـالَمِـين ، اللَّهُـمَّ إِنِّـي أسْـأَلُـكَ خَيْرَ هـذا الـيَوْم ، فَتْحَهُ ، وَنَصْـرَهُ ، وَنُورَهُ وَبَـرَكَتَهُ ، وَهُـدَاهُ ، وَأَعْـوذُ بِـكَ مِـنْ شَرِّ مَا فِـيهِ وَشَرِّ مَا بَعْـدَهُ.",
        repeat: 1,
        bless: "",
      ),
      ZikrItem(
        zekr:
            "اللَّهُـمَّ عَالِـمَ الغَـيبِ وَالشَّـهادَةِ فاطِـرَ السَّمَاوَاتِ وَالأرْضِ رَبَّ كُـلِّ شَـيءٍ وَمَلِكَهُ ، أَشْهَـدُ أَنْ لاَ إِلَهَ إِلَّا أَنْتَ ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا أَوْ أُجْرِّهِ إِلَى مُسْلِمٍ.",
        repeat: 1,
        bless: "",
      ),
      ZikrItem(
        zekr: "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ.",
        repeat: 3,
        bless: "",
      ),
      ZikrItem(
        zekr:
            "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ.",
        repeat: 10,
        bless: "من صلى على حين يصبح وحين يمسى ادركته شفاعتي يوم القيامة.",
      ),
      ZikrItem(
        zekr:
            "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لاَ نَعْلَمُهُ.",
        repeat: 3,
        bless: "",
      ),
      ZikrItem(
        zekr:
            "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنَ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ.",
        repeat: 3,
        bless: "",
      ),
      ZikrItem(
        zekr:
            "أَسْتَغْفِرُ اللَّهَ الْعَظِيمَ الَّذِي لاَ إِلَهَ إِلَّا هُوَ، الْحَيُّ الْقَيُّومُ، وَأَتُوبُ إِلَيْهِ.",
        repeat: 3,
        bless: "",
      ),
      ZikrItem(
        zekr:
            "يَا رَبِّ، لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ، وَلِعَظِيمِ سُلْطَانِكَ.",
        repeat: 3,
        bless: "",
      ),
      ZikrItem(
        zekr:
            "اللَّهُمَّ أَنْتَ رَبِّي لاَ إِلَهَ إِلَّا أَنْتَ، عَلَيْكَ تَوَكَّلْتُ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ، مَا شَاءَ اللَّهُ كَانَ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ، أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، وَأَنَّ اللَّهَ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ.",
        repeat: 1,
        bless: "",
      ),
      ZikrItem(
        zekr:
            "لاَ إِلَهَ إِلَّا اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٍ.",
        repeat: 100,
        bless:
            "كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزاً من الشيطان.",
      ),
      ZikrItem(
        zekr: "سُبْحَانَ اللهِ وَبِحَمْدِهِ.",
        repeat: 100,
        bless:
            "حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ.",
      ),
    ],
  ),
  Azkar(
//"أذكار بعد الصلاة"
    title: "أذكار بعد الصلاة",
    image: 'images/salah.png',
    content: [
      ZikrItem(
        zekr:
            "أسـتغفر الله، أسـتغفر الله، أسـتغفر الله. اللّهـم أنت السلام، ومنك السلام، تباركت يا ذا الجلال والإكرام.",
        repeat: 1,
        bless: "",
      ),
      ZikrItem(
        zekr:
            "لا إله إلا الله وحده لا شريك له، له الملك وله الحمد، وهو على كل شيء قدير، اللّهـم لا مانع لما أعطيت، ولا معطي لما منعت، ولا ينفع ذا الجد منك الجد.",
        repeat: 1,
        bless: "",
      ),
      ZikrItem(
        zekr:
            "لا إله إلا الله، وحده لا شريك له، له الملك وله الحمد، وهو على كل شيء قدير، لا حـول ولا قـوة إلا بالله، لا إله إلا اللـه، ولا نعـبـد إلا إيـاه، له النعـمة وله الفضل وله الثـناء الحـسن، لا إله إلا الله مخلصـين لـه الدين ولو كـره الكـافرون.",
        repeat: 1,
        bless: "",
      ),
      ZikrItem(
        zekr: "سـبحان الله، والحمـد لله، والله أكـبر.",
        repeat: 33,
        bless: "",
      ),
      ZikrItem(
        zekr:
            "لا إله إلا الله وحـده لا شريك له، له الملك وله الحمد، وهو على كل شيء قـدير.",
        repeat: 1,
        bless: "",
      ),
      ZikrItem(
        zekr:
            "بِسْمِ اللهِ الرَّحمنِ الرَّحيم 'قل هو ٱللّهُ أحد، ٱللّهُ ٱلصمد، لم يلد ولم يولد، ولم يكن لهۥ كفوا أحد'.",
        repeat: 3,
        bless: "ثلاث مرات بعد صلاتي الفجر والمغرب، ومرة بعد الصلوات الأخرى.",
      ),
      ZikrItem(
        zekr:
            "أسْمِ اللهِ الرَّحمنِ الرَّحيم 'قل أعوذ برب ٱلْفَلَقِ، من شر ما خلق، ومن شر غاسق إذا وقب، ومن شر ٱلنَّفَّاثات في ٱلْعُقَدِ، ومن شر حاسد إذا حسد'.",
        repeat: 3,
        bless: "ثلاث مرات بعد صلاتي الفجر والمغرب، ومرة بعد الصلوات الأخرى.",
      ),
      ZikrItem(
        zekr:
            "سْمِ اللهِ الرَّحمنِ الرَّحيم 'قل أعوذ برب ٱلنَّاسِ، ملك ٱلنَّاسِ، إلٰه ٱلنَّاسِ، من شر ٱلْوَسَوَاسِ ٱلْخَنَّاسِ، الذي يوسوس في صدور ٱلْنَّاسِ، من ٱلْجِنَّةِ وَٱلْنَّاسِ'.",
        repeat: 3,
        bless: "ثلاث مرات بعد صلاتي الفجر والمغرب، ومرة بعد الصلوات الأخرى.",
      ),
      ZikrItem(
        zekr:
            "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ 'الله لا إلـه إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤوده حفظهما وهو العلي العظيم' -آية الكرسي,البقرة ,255.",
        repeat: 1,
        bless: "",
      ),
      ZikrItem(
        zekr:
            "لا إله إلا الله وحـده لا شريك له، له الملك وله الحمد، يحيـي ويمـيت وهو على كل شيء قدير.",
        repeat: 10,
        bless: "عشر مرات بعد المغرب والصبح.",
      ),
      ZikrItem(
        zekr:
            "اللّهُـمَّ إِنِّـي أَسْأَلُـكَ عِلْمًا نافِعًا وَرِزْقًا طَيِبًا، وَعَمَلًا مُتَقَبَّلًا.",
        repeat: 1,
        bless: "بعد السلام من صلاة الفجر.",
      ),
      ZikrItem(
        zekr: "اللهم أجرني من النار.",
        repeat: 7,
        bless: "بعد صلاة الصبح والمغرب.",
      ),
      ZikrItem(
        zekr: "اللهم أعني على ذكرك وشكرك وحسن عبادتك.",
        repeat: 1,
        bless: "",
      ),
    ],
  ),
];
